# Make sure apps get installed in system Applications dir
cask_args appdir: '/Applications'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'

# Install GNU core utilities (those that come with OS X are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install a modern version of Bash.
brew 'bash'
brew 'bash-completion2'

# Install Java utilities
brew 'openjdk@8'
brew 'openjdk@11'
brew 'jenv'

brew 'maven'
brew 'gradle'
brew 'tomcat'

# Install python3
brew 'python3'
brew 'pyenv'

# Install ruby
brew 'ruby'

# Install k8s and helm
brew 'kubectl'
brew 'helm'

# Other binaries
brew 'jq'
brew 'telnet'
brew 'git'
brew 'awscli'
brew 'wget'
brew 'node'
brew 'postgresql'
brew 'grep'
brew 'screen'
brew 'ripgrep'

# Shell
brew 'starship'

# Emacs
brew 'emacs'

# Apps
# cask 'mactex'
# cask 'firefox'
# cask 'iterm2'
# cask 'atom'
# cask 'jetbrains-toolbox'
# cask 'datagrip'
# cask 'rectangle'
# cask 'docker'

# Fonts
tap 'homebrew/cask-fonts'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-dejavu-sans-mono-nerd-font'
